case file/Room Ventilation CaseD2 CFD OpenFOAM/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 295;

boundaryField
{
	"wall.*"
    {
      	type            fixedValue;
	value 		uniform 295;
    }
	"inlet.*"
    {
      	type            fixedValue;
	value 		uniform 295;
    }
	"outlet.*"
    {
      	type            fixedValue;
	value 		uniform 295;
    }
	fan_1
    {
      	type            fixedValue;
	value 		uniform 295;
    }
	AMI_1
    {
      	type            fixedValue;
	value 		uniform 295;
    }	 
	AMI_1_slave
    {
      	type            fixedValue;
	value 		uniform 295;
    } 
}
// ************************************************************************* //
