case file/Room Ventilation CaseD2 CFD OpenFOAM/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	inlet_1
    {
        type            	flowRateInletVelocity;
	volumetricFlowRate	0.2566;
	value			uniform (0 0 1);
    }
	inlet_2
    {
        type            	flowRateInletVelocity;
	volumetricFlowRate	0.04;
	value			uniform (0 0 -1);
    }
	"wall.*"
    {
        type            noSlip;         
    }
	outlet_1
    {
        type            	pressureInletOutletVelocity;
        value           	$internalField;
    }
	outlet_2
    {
        type            	flowRateInletVelocity;
	volumetricFlowRate	0.04;
	value			uniform (0 0 1);
    }
	fan_1
    {
        type            	movingWallVelocity;
	value			uniform (0 0 0);
    }
	AMI_1
    {
        type            noSlip;         
    }
	AMI_1_slave
    {
        type            noSlip;  
    } 
}


// ************************************************************************* //
