case file/Room Ventilation CaseD2 CFD OpenFOAM/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

	"wall.*"
    {
        type            compressible::alphatWallFunction;
	prt				0.85;
        value           uniform 0;
    }
	"inlet.*"
    {
        type            compressible::alphatWallFunction;
	prt				0.85;
        value           uniform 0;
    }
	 "outlet.*"
    {
        type            compressible::alphatWallFunction;
	prt				0.85;
        value           uniform 0;
    }
	fan_1
    {
        type            compressible::alphatWallFunction;
	prt				0.85;
        value           uniform 0;
    }
	AMI_1
    {
        type            compressible::alphatWallFunction;
	prt				0.85;
        value           uniform 0;
    } 
	AMI_1_slave
    {
        type            compressible::alphatWallFunction;
	prt				0.85;
        value           uniform 0;
    } 
}
// ************************************************************************* //
