case file/Room Ventilation CaseD2 CFD OpenFOAM/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField


{
	"wall.*"
    {
         type           epsilonWallFunction; 
        value           uniform 0.01;
    }
	"inlet.*"
    {
         type           epsilonWallFunction; 
        value           uniform 0.01;
    }
	"outlet.*"
    {
         type             epsilonWallFunction; 
        value           uniform 0.01;
    }
	fan_1
    {
         type           epsilonWallFunction; 
        value           uniform 0.01;
    }
	AMI_1
    {
         type           epsilonWallFunction; 
        value           uniform 0.01;
    } 
	AMI_1_slave
    {
         type           epsilonWallFunction; 
        value           uniform 0.01;
    } 
}

// ************************************************************************* //
