case file/Room Ventilation CaseD2 CFD OpenFOAM/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
	"wall.*"
    {
	type              	kqRWallFunction; 
	value           	$internalField;
    }
	"inlet.*"
    {
	type              	kqRWallFunction; 
	value           	$internalField;
    }
	 "outlet.*"
    {
	type              	kqRWallFunction; 
	value           	$internalField;
    }
	fan_1
    {
	type              	kqRWallFunction; 
	value           	$internalField;
    }
	AMI_1
    {
	type              	kqRWallFunction; 
	value           	$internalField;
    } 
	AMI_1_slave
    {
	type              	kqRWallFunction; 
	value           	$internalField;
    } 
}

// ************************************************************************* //
