case file/Room Ventilation CaseD2 CFD OpenFOAM/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField

{
	"wall.*"
    {
         type           nutkWallFunction; 
        value           uniform 0.1;
    }
	"inlet.*"
    {
         type           nutkWallFunction; 
        value           uniform 0.1;
    }
	"outlet.*"
    {
         type           nutkWallFunction; 
        value           uniform 0.1;
    } 
	fan_1
    {
         type           nutkWallFunction; 
        value           uniform 0.1;
    }
	AMI_1
    {
         type           nutkWallFunction; 
        value           uniform 0.1;
    } 
	AMI_1_slave
    {
         type           nutkWallFunction; 
        value           uniform 0.1;
    } 
}

// ************************************************************************* //
