case file/Room Ventilation CaseD2 CFD OpenFOAM/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
	"wall.*"
    {
        type              zeroGradient;
    }
	"inlet.*"
    {
        type              zeroGradient; 
    }
	"outlet.*"
    {
        type 		fixedValue;
	value 		uniform 100000;
    }	
	fan_1
    {
        type              zeroGradient;
    }
	AMI_1
    {
        type              zeroGradient;
    }
	AMI_1_slave
    {
        type              zeroGradient;
    }  
}
// ************************************************************************* //
