case file/Room Ventilation CaseD2 CFD OpenFOAM/Allmesh
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------
#cleaningFirt
./Allclean
# - force removal of fields generated by snappy
rm -rf 0
#meshingStart
runApplication blockMesh 
runApplication surfaceFeatures 
runApplication decomposePar 
runParallel snappyHexMesh -overwrite 
runApplication checkMesh
runApplication reconstructParMesh -constant
# renumber the mesh
runApplication renumberMesh -overwrite 
# - set the initial fields
cp -r 0.orig 0
#display mesh file
touch snappy.foam
#------------------------------------------------------------------------------
