case file/Room Ventilation CaseD2 CFD OpenFOAM/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-1 -1 -1)
    (11 -1 -1)
    (11  7 -1)
    (-1 7 -1)
    (-1 -1 4)
    (11 -1 4)
    (11  7 4)
    (-1  7 4)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 60 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
/*
   allBoundary
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
*/
);

// ************************************************************************* //
