case file/Room Ventilation CaseD2 CFD OpenFOAM/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
surfaces
(
"desk.stl"
"door_1.stl"
"door_2.stl"
"exhaust_air.stl"
"floor.stl"
"occupant_1.stl"
"occupant_2.stl"
"occupant_3.stl"
"occupant_4.stl"
"room.stl"
"supply_air.stl"
"tH_in.stl"
"tH_out.stl"
"window_1.stl"
"window_2.stl"
"window_3.stl"
"window_4.stl"
"AMI_one.stl"
"fan_1.stl"
);


// Identify a feature when angle between faces < includedAngle
includedAngle   150;
subsetFeatures
{
    // Keep nonManifold edges (edges with >2 connected faces)
    nonManifoldEdges       yes;

    // Keep open edges (edges with 1 connected face)
    openEdges       yes;
}

// ************************************************************************* //
